<?
require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/header.php");
$APPLICATION->SetTitle("Видеогалерея");
?>
<div class="max s-bar">
    <div class="left-block">
        <div class="l-menu">
            <? $APPLICATION->IncludeComponent(
                "bitrix:menu",
                "menu_top",
                array(
                    "ALLOW_MULTI_SELECT" => "N",
                    "CHILD_MENU_TYPE" => "about",
                    "DELAY" => "N",
                    "MAX_LEVEL" => "2",
                    "MENU_CACHE_GET_VARS" => array(""),
                    "MENU_CACHE_TIME" => "3600",
                    "MENU_CACHE_TYPE" => "Y",
                    "MENU_CACHE_USE_GROUPS" => "Y",
                    "ROOT_MENU_TYPE" => "about",
                    "USE_EXT" => "Y"
                )
            ); ?>
        </div>

        <div class="btn-soc">
            <a href="#" class="btn-wh">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_702_3417)">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M20.4 3.45C18.15 1.2 15.15 0 12 0C5.4 0 0 5.4 0 12C0 14.1 0.600009 16.2 1.65001 18L0 24L6.30002 22.35C8.10002 23.25 10.05 23.85 12 23.85C18.6 23.85 24 18.45 24 11.85C24 8.7 22.65 5.7 20.4 3.45ZM12 21.9C10.2 21.9 8.40001 21.45 6.90001 20.55L6.59999 20.4L2.84999 21.45L3.90001 17.85L3.59999 17.4C2.54999 15.75 2.09999 13.95 2.09999 12.15C2.09999 6.75 6.6 2.25 12 2.25C14.7 2.25 17.1 3.3 19.05 5.1C21 7.05 21.9 9.45 21.9 12.15C21.9 17.4 17.55 21.9 12 21.9ZM17.4 14.4C17.1 14.25 15.6 13.5 15.3 13.5C15 13.35 14.85 13.35 14.7 13.65C14.55 13.95 13.95 14.55 13.8 14.85C13.65 15 13.5 15 13.2 15C12.9 14.85 12 14.55 10.8 13.5C9.90002 12.75 9.30001 11.7 9.15001 11.4C9.00001 11.1 9.15002 10.95 9.30002 10.8C9.45002 10.65 9.6 10.5 9.75 10.35C9.9 10.2 9.90002 10.05 10.05 9.9C10.2 9.75 10.05 9.6 10.05 9.45C10.05 9.3 9.45001 7.8 9.15001 7.2C9.00001 6.75 8.70002 6.75 8.55002 6.75C8.40002 6.75 8.24998 6.75 7.94998 6.75C7.79998 6.75 7.49998 6.75 7.19998 7.05C6.89998 7.35 6.15001 8.1 6.15001 9.6C6.15001 11.1 7.19999 12.45 7.34999 12.75C7.49999 12.9 9.44998 16.05 12.45 17.25C15 18.3 15.45 18 16.05 18C16.65 18 17.85 17.25 18 16.65C18.3 15.9 18.3 15.3 18.15 15.3C18 14.55 17.7 14.55 17.4 14.4Z" fill="white"></path>
                    </g>
                    <defs>
                        <clipPath id="clip0_702_3417">
                            <rect width="24" height="24" fill="white"></rect>
                        </clipPath>
                    </defs>
                </svg>

                <span>Написать в WhatsApp</span>
            </a>
            <a href="http://vk.com/valka_derevev_spb" class="btn-vk">
                <svg width="24" height="16" viewBox="0 0 24 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.0225 15.5C5.16434 15.5 0.683816 9.8795 0.5 0.51201H4.45205C4.57842 7.38151 7.47353 10.2878 9.77123 10.8883V0.51201H13.482V6.43275C15.7453 6.18054 18.1349 3.47838 18.9391 0.5H22.6384C22.3367 2.04175 21.7342 3.50192 20.8684 4.78927C20.0026 6.07662 18.8921 7.16349 17.6064 7.98199C19.0412 8.72853 20.3084 9.78457 21.3243 11.0805C22.3401 12.3763 23.0817 13.8826 23.5 15.5H19.4216C18.5485 12.6537 16.3656 10.444 13.482 10.1437V15.5H13.034H13.0225Z" fill="white"></path>
                </svg>
                <span>Подписаться НА ВК</span>
            </a>
        </div>
    </div>
    <div class="right-block">
        <div class="banner-page" style="background-image: url(/local/assets/img/pages/videogalereya.png);">
            <h1 class="p-title"><span>Видеогалерея</span></h1>
        </div>

        <div class="btn-soc mob">
            <a href="#" class="btn-wh">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_702_3417)">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M20.4 3.45C18.15 1.2 15.15 0 12 0C5.4 0 0 5.4 0 12C0 14.1 0.600009 16.2 1.65001 18L0 24L6.30002 22.35C8.10002 23.25 10.05 23.85 12 23.85C18.6 23.85 24 18.45 24 11.85C24 8.7 22.65 5.7 20.4 3.45ZM12 21.9C10.2 21.9 8.40001 21.45 6.90001 20.55L6.59999 20.4L2.84999 21.45L3.90001 17.85L3.59999 17.4C2.54999 15.75 2.09999 13.95 2.09999 12.15C2.09999 6.75 6.6 2.25 12 2.25C14.7 2.25 17.1 3.3 19.05 5.1C21 7.05 21.9 9.45 21.9 12.15C21.9 17.4 17.55 21.9 12 21.9ZM17.4 14.4C17.1 14.25 15.6 13.5 15.3 13.5C15 13.35 14.85 13.35 14.7 13.65C14.55 13.95 13.95 14.55 13.8 14.85C13.65 15 13.5 15 13.2 15C12.9 14.85 12 14.55 10.8 13.5C9.90002 12.75 9.30001 11.7 9.15001 11.4C9.00001 11.1 9.15002 10.95 9.30002 10.8C9.45002 10.65 9.6 10.5 9.75 10.35C9.9 10.2 9.90002 10.05 10.05 9.9C10.2 9.75 10.05 9.6 10.05 9.45C10.05 9.3 9.45001 7.8 9.15001 7.2C9.00001 6.75 8.70002 6.75 8.55002 6.75C8.40002 6.75 8.24998 6.75 7.94998 6.75C7.79998 6.75 7.49998 6.75 7.19998 7.05C6.89998 7.35 6.15001 8.1 6.15001 9.6C6.15001 11.1 7.19999 12.45 7.34999 12.75C7.49999 12.9 9.44998 16.05 12.45 17.25C15 18.3 15.45 18 16.05 18C16.65 18 17.85 17.25 18 16.65C18.3 15.9 18.3 15.3 18.15 15.3C18 14.55 17.7 14.55 17.4 14.4Z" fill="white"></path>
                    </g>
                    <defs>
                        <clipPath id="clip0_702_3417">
                            <rect width="24" height="24" fill="white"></rect>
                        </clipPath>
                    </defs>
                </svg>

                <span>Написать в WhatsApp</span>
            </a>
            <a href="http://vk.com/valka_derevev_spb" class="btn-vk">
                <svg width="24" height="16" viewBox="0 0 24 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.0225 15.5C5.16434 15.5 0.683816 9.8795 0.5 0.51201H4.45205C4.57842 7.38151 7.47353 10.2878 9.77123 10.8883V0.51201H13.482V6.43275C15.7453 6.18054 18.1349 3.47838 18.9391 0.5H22.6384C22.3367 2.04175 21.7342 3.50192 20.8684 4.78927C20.0026 6.07662 18.8921 7.16349 17.6064 7.98199C19.0412 8.72853 20.3084 9.78457 21.3243 11.0805C22.3401 12.3763 23.0817 13.8826 23.5 15.5H19.4216C18.5485 12.6537 16.3656 10.444 13.482 10.1437V15.5H13.034H13.0225Z" fill="white"></path>
                </svg>
                <span>Подписаться НА ВК</span>
            </a>
        </div>

        <div class="text-page">
            <? $APPLICATION->IncludeComponent(
                "bitrix:news.list",
                "videogallery",
                array(
                    "ACTIVE_DATE_FORMAT" => "d.m.Y",    // Формат показа даты
                    "ADD_SECTIONS_CHAIN" => "N",    // Включать раздел в цепочку навигации
                    "AJAX_MODE" => "N",    // Включить режим AJAX
                    "AJAX_OPTION_ADDITIONAL" => "",    // Дополнительный идентификатор
                    "AJAX_OPTION_HISTORY" => "N",    // Включить эмуляцию навигации браузера
                    "AJAX_OPTION_JUMP" => "N",    // Включить прокрутку к началу компонента
                    "AJAX_OPTION_STYLE" => "Y",    // Включить подгрузку стилей
                    "CACHE_FILTER" => "N",    // Кешировать при установленном фильтре
                    "CACHE_GROUPS" => "Y",    // Учитывать права доступа
                    "CACHE_TIME" => "36000000",    // Время кеширования (сек.)
                    "CACHE_TYPE" => "A",    // Тип кеширования
                    "CHECK_DATES" => "Y",    // Показывать только активные на данный момент элементы
                    "DETAIL_URL" => "",    // URL страницы детального просмотра (по умолчанию - из настроек инфоблока)
                    "DISPLAY_BOTTOM_PAGER" => "Y",    // Выводить под списком
                    "DISPLAY_DATE" => "Y",    // Выводить дату элемента
                    "DISPLAY_NAME" => "Y",    // Выводить название элемента
                    "DISPLAY_PICTURE" => "Y",    // Выводить изображение для анонса
                    "DISPLAY_PREVIEW_TEXT" => "Y",    // Выводить текст анонса
                    "DISPLAY_TOP_PAGER" => "N",    // Выводить над списком
                    "FIELD_CODE" => array(    // Поля
                        0 => "",
                        1 => "",
                    ),
                    "FILTER_NAME" => "",    // Фильтр
                    "HIDE_LINK_WHEN_NO_DETAIL" => "N",    // Скрывать ссылку, если нет детального описания
                    "IBLOCK_ID" => "6",    // Код информационного блока
                    "IBLOCK_TYPE" => "content",    // Тип информационного блока (используется только для проверки)
                    "INCLUDE_IBLOCK_INTO_CHAIN" => "N",    // Включать инфоблок в цепочку навигации
                    "INCLUDE_SUBSECTIONS" => "Y",    // Показывать элементы подразделов раздела
                    "MESSAGE_404" => "",    // Сообщение для показа (по умолчанию из компонента)
                    "NEWS_COUNT" => "20",    // Количество новостей на странице
                    "PAGER_BASE_LINK_ENABLE" => "N",    // Включить обработку ссылок
                    "PAGER_DESC_NUMBERING" => "N",    // Использовать обратную навигацию
                    "PAGER_DESC_NUMBERING_CACHE_TIME" => "36000",    // Время кеширования страниц для обратной навигации
                    "PAGER_SHOW_ALL" => "N",    // Показывать ссылку "Все"
                    "PAGER_SHOW_ALWAYS" => "N",    // Выводить всегда
                    "PAGER_TEMPLATE" => ".default",    // Шаблон постраничной навигации
                    "PAGER_TITLE" => "Новости",    // Название категорий
                    "PARENT_SECTION" => "",    // ID раздела
                    "PARENT_SECTION_CODE" => "",    // Код раздела
                    "PREVIEW_TRUNCATE_LEN" => "",    // Максимальная длина анонса для вывода (только для типа текст)
                    "PROPERTY_CODE" => array(    // Свойства
                        0 => "VIDEO_URL",
                        1 => "",
                    ),
                    "SET_BROWSER_TITLE" => "N",    // Устанавливать заголовок окна браузера
                    "SET_LAST_MODIFIED" => "N",    // Устанавливать в заголовках ответа время модификации страницы
                    "SET_META_DESCRIPTION" => "N",    // Устанавливать описание страницы
                    "SET_META_KEYWORDS" => "N",    // Устанавливать ключевые слова страницы
                    "SET_STATUS_404" => "N",    // Устанавливать статус 404
                    "SET_TITLE" => "N",    // Устанавливать заголовок страницы
                    "SHOW_404" => "N",    // Показ специальной страницы
                    "SORT_BY1" => "ACTIVE_FROM",    // Поле для первой сортировки новостей
                    "SORT_BY2" => "SORT",    // Поле для второй сортировки новостей
                    "SORT_ORDER1" => "DESC",    // Направление для первой сортировки новостей
                    "SORT_ORDER2" => "ASC",    // Направление для второй сортировки новостей
                    "STRICT_SECTION_CHECK" => "N",    // Строгая проверка раздела для показа списка
                ),
                false
            ); ?>
        </div>
    </div>
</div>

<div class="fon-bottom rew"></div>

<? $APPLICATION->IncludeComponent(
    "bitrix:main.include",
    "",
    array(
        "AREA_FILE_SHOW" => "file",
        "AREA_FILE_SUFFIX" => "inc",
        "EDIT_TEMPLATE" => "",
        "PATH" => "/include/advantages.php"
    )
); ?>

<? $APPLICATION->IncludeComponent(
    "bitrix:main.include",
    "",
    array(
        "AREA_FILE_SHOW" => "file",
        "AREA_FILE_SUFFIX" => "inc",
        "EDIT_TEMPLATE" => "",
        "PATH" => "/include/feedback.php"
    )
); ?>
<? require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/footer.php"); ?>