<?if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED!==true)die();?> 
<section class="block-5">
    <div class="max">
        <div class="zayavka">
            <div class="img">
                <img src="/local/assets/img/man.png" alt="">
                <a href="#" class="btn green">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_702_3417)">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M20.4 3.45C18.15 1.2 15.15 0 12 0C5.4 0 0 5.4 0 12C0 14.1 0.600009 16.2 1.65001 18L0 24L6.30002 22.35C8.10002 23.25 10.05 23.85 12 23.85C18.6 23.85 24 18.45 24 11.85C24 8.7 22.65 5.7 20.4 3.45ZM12 21.9C10.2 21.9 8.40001 21.45 6.90001 20.55L6.59999 20.4L2.84999 21.45L3.90001 17.85L3.59999 17.4C2.54999 15.75 2.09999 13.95 2.09999 12.15C2.09999 6.75 6.6 2.25 12 2.25C14.7 2.25 17.1 3.3 19.05 5.1C21 7.05 21.9 9.45 21.9 12.15C21.9 17.4 17.55 21.9 12 21.9ZM17.4 14.4C17.1 14.25 15.6 13.5 15.3 13.5C15 13.35 14.85 13.35 14.7 13.65C14.55 13.95 13.95 14.55 13.8 14.85C13.65 15 13.5 15 13.2 15C12.9 14.85 12 14.55 10.8 13.5C9.90002 12.75 9.30001 11.7 9.15001 11.4C9.00001 11.1 9.15002 10.95 9.30002 10.8C9.45002 10.65 9.6 10.5 9.75 10.35C9.9 10.2 9.90002 10.05 10.05 9.9C10.2 9.75 10.05 9.6 10.05 9.45C10.05 9.3 9.45001 7.8 9.15001 7.2C9.00001 6.75 8.70002 6.75 8.55002 6.75C8.40002 6.75 8.24998 6.75 7.94998 6.75C7.79998 6.75 7.49998 6.75 7.19998 7.05C6.89998 7.35 6.15001 8.1 6.15001 9.6C6.15001 11.1 7.19999 12.45 7.34999 12.75C7.49999 12.9 9.44998 16.05 12.45 17.25C15 18.3 15.45 18 16.05 18C16.65 18 17.85 17.25 18 16.65C18.3 15.9 18.3 15.3 18.15 15.3C18 14.55 17.7 14.55 17.4 14.4Z"
                                fill="white"></path>
                        </g>
                        <defs>
                            <clipPath id="clip0_702_3417">
                                <rect width="24" height="24" fill="white"></rect>
                            </clipPath>
                        </defs>
                    </svg>

                    <span>Написать в WhatsApp</span></a>
            </div>
            <div class="cont">
                <h3>Оставь заявку</h3>
                <div class="form-z">
                    <form action="#">
                        <?=bitrix_sessid_post()?>
                        <div class="block">
                            <input type="text" placeholder="ИМЯ">
                        </div>
                        <div class="block">
                            <input type="tel" placeholder="ТЕЛЕФОН">
                        </div>
                        <div class="block" data-file>
                            <button type="button" class="file-up">
                                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 26 26">
                                    <g clip-path="url(#a)">
                                        <path fill="#4DC167"
                                            d="M9.14 23.3c-.04 0 .05.01 0 0ZM19.91 0H6.09A6.1 6.1 0 0 0 0 6.1v7.61c.05 1.35 1.98 1.35 2.03 0V6.1A4.07 4.07 0 0 1 6.1 2.03h13.82a4.07 4.07 0 0 1 4.06 4.06v7.62c.05 1.35 1.98 1.35 2.03 0V6.1A6.1 6.1 0 0 0 19.9 0ZM9.27 21.29c-4.72-.61-7.24-2.44-7.24-3.52a1.02 1.02 0 1 0-2.03 0c0 .96.49 2.37 2.81 3.67 1.6.89 3.93 1.56 6.33 1.87a1.02 1.02 0 0 0 .13-2.02Zm2.67-2.3c-1-.92-2.35.45-1.43 1.43l1.57 1.56c.2.2.2.55 0 .75l-1.57 1.53a1.02 1.02 0 0 0 1.42 1.45l1.57-1.53h.01c1-.96 1-2.68 0-3.64l-1.57-1.56Zm5.12 4.1c.05 0-.05 0 0 0Zm7.92-6.33c-.56 0-1.01.45-1.01 1.01 0 .54-.63 1.2-1.7 1.76-1.3.7-3.2 1.25-5.35 1.54a1.02 1.02 0 0 0 .14 2.02c3.5-.41 9-2.08 8.94-5.32 0-.56-.45-1.01-1.02-1.01ZM10.97 6.14h-.81c-1.35-.05-1.35-1.97 0-2.03h.8c1.36.06 1.36 1.98 0 2.03ZM7.1 5.13c0-.56-.46-1.02-1.02-1.02h-.8c-1.36.06-1.36 1.98 0 2.03h.8c.56 0 1.02-.45 1.02-1.01Zm9.75 0c0-.56-.46-1.02-1.02-1.02h-.8c-1.36.06-1.36 1.98 0 2.03h.8c.56 0 1.02-.45 1.02-1.01Zm4.87 0c0-.56-.45-1.02-1.01-1.02h-.81c-1.35.06-1.35 1.98 0 2.03h.8c.57 0 1.02-.45 1.02-1.01ZM13.1 16.58l3.34-1.99a2.3 2.3 0 0 0 1.14-2 2.3 2.3 0 0 0-1.14-2L13.1 8.62a2.32 2.32 0 0 0-2.37-.02 2.3 2.3 0 0 0-1.17 2.02v3.97a2.35 2.35 0 0 0 3.54 2Zm-1.04-6.22 3.34 1.98c.2.12.2.39 0 .5l-3.34 2a.3.3 0 0 1-.32 0 .28.28 0 0 1-.15-.26v-3.97c0-.14.08-.22.15-.26.03-.02.09-.04.16-.04.05 0 .1.01.16.04Z" />
                                    </g>
                                    <defs>
                                        <clipPath id="a">
                                            <path fill="#fff" d="M0 0h26v26H0z" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                <span>Загрузить видео ОБЪЕКТА</span>
                            </button>
                            <input id="up-file" name="file" multiple type="file">
                        </div>
                        <div class="block">
                            <button class="submit" type="submit"><span>Консультация мастера</span></button>
                        </div>
                        <img class="txt-2" src="/local/assets/img/txt-2.png" alt="">
                    </form>
                </div>
            </div>
            <img class="txt-1" src="/local/assets/img/txt-1.png" alt="">
            <img class="txt-3" src="/local/assets/img/txt-3.png" alt="">
            <img class="txt-4" src="/local/assets/img/txt-4.png" alt="">
            <img class="txt-5" src="/local/assets/img/txt-5.png" alt="">
            <img class="txt-6" src="/local/assets/img/txt-6.png" alt="">
        </div>
    </div>
</section>